import pytest
from text_to_sidc.austrian import UnitDesignator

@pytest.mark.parametrize("input_text, expected_sidc", [
    # ОВТ
    ("08.08.21 1 од. ОіВТ невизначеного типу (Космічний знімок)", "30061500001200000000"),
    # C2, КШМ
    ("02.08.23 неідентифікований КП ров, на північний захід від Червонопопівка (Взаємодія)", "30061000001100000000"), 
    ("Командно-спостережний пункт (КСП)", "30061000001100000000"),
    ("КШМ", "30061500001201020000"),
    # ППО Бук
    ("18.08.23 1 ЗРК 9К37 “Бук” (Космічний знімок)", "30061500331111040000"), 
    ("09.09.23 1 од. ПУ Бук-М2 біля н.п Нововасилівка (Взаємодія)", "30061500331111040000"),
    ("БУК М3", "30061500331111040000"),
    ("БУК", "30061500331111040000"),
    ("9А317", "30061500331111040000"),
    ("BUK M3", "30061500331111040000"),
    ("BUK M2", "30061500331111040000"),
    # Additional test cases
         # ППО С-300В
    ("20.08.23 Російський С-300ВМ «Антей-2500» (Взаємодія)", "30061500331111070000"),
    ("РЛС 9С15", "30061500332203000000"),
    # РЛС
    ("21.08.23 РЛС 91N6 (Взаємодія)", "30061500322203000000"),
    ("РЛС 76Н6", "30061500322203000000"),
    ("ЗРК БУК М3 СОЦ 9С18 КУПОЛ", "30061500332203000000"),
    ("21.08.23 РЛС 91N6 (Взаємодія)", "30061500322203000000"),
    ("04.09.23 Ніобій-СВ", "30061500322203000000"),
    ("РЛС 1Л122-1Е «Гармонь»", "30061500002203000000"),
    ("РЛС ППО 1Л122-1Е Гармонь", "30061500002203000000"),
    # Тестую регулярку
    # ("Я ищу в РЛСAвске ", None),
    # ІФО
    ("Траншея", "30062500002812000000"),
    ("Окоп", "30062500002812000000"),
    ("Виявлено ФОМ (космічний знімок)", "30062500002812000000"),
    # Пеленги радіостанцій космос
    ("VSAT", "30061000001110040000"),
    ("P-438", "30061000001110040000"),
    ("Р-441", "30061000001110040000"),
    ("Пеленг станції тропосферного зв'язку Р-423", "30061000001110040000"),
    ("MULTIPLE GROUND SATELLITES", "30061000001110040000"),
    # Пеленги радіостанцій
    ("Р-440", "30061500002001000000"),
    # Signal - Radio
    ("05.09.2023 Пеленг R-444 5386677 7424920", "30061000001110010000"),
    ("Р-444", "30061000001110010000"),
    ("Р-187", "30061000001110010000"),
    ("01.0923 Пеленг радіостанції Азарт R-187 61 Засічок  /10 днів, 47.4931, 35.6743", "30061000001110010000"),
    ("P-187", "30061000001110010000"),
    ("ПЕЛЕНГ РАДІОСТАНЦІЇ R-168", "30061000001110010000"),
    ("Р-168", "30061000001110010000"),
    ("Р-392", "30061000001110010000"),
    ("DMR", "30061000001110010000"),
    ("Пеленг УКХ зв'язку", "30061000001110010000"),
    ("P-392", "30061000001110010000"),
    ("АМ зв'язку", "30061000001110010000"),
    # Signal - Radio Relay
    ("Пеленг радіорелейної станції Р-419", "30061000001110020000"),
    ("Пеленг радіорелейної станції Р-415", "30061000001110020000"),
    ("Р-409", "30061000001110020000"),
    ("реле зв’язку св зс рф", "30061000001110020000"),
    # Signal
    ("10.09.23 АМ зв’язку (Взаємодія)", "30061000001110000000"),
    ("Пеленг невстановленого обладнання", "30061000001110000000"),
    ("AR-2", "30061000001110000000"),
    ("COMMS STATION", "30061000001110000000"),
    #
    ("22.08.23 Вогневе ураження", "30064000001106000000"),
    ("26.08.23 МТ-12 Рапіра", "30061500351106010000"),
    ("31.08.23 1 БАТ-2, 5 вантажних військових автомобілів (Космічний знімок)", "30061500001311000000"),
    ("01.09.23 'Стріла-2М' (9К32)", "30061500331111010000"),
    ("09.09.23 «Стріла-3» (9К34)", "30061500331111010000"),
    # ЗРК ТОР
    ("02.09.23 ЗРК ТОР рф (Взаємодія)", "30061500331111050000"),
    ("ТОР М2", "30061500331111050000"),
    ("TOP М1", "30061500331111050000"),
    ("ТОР М1", "30061500331111050000"),
    ("SAM TOR M2", "30061500331111050000"),
    ("SAM TOR M1/M2", "30061500331111050000"),
    ("SA-15", "30061500331111050000"),
    # Панцир
    ("31.08.23 ЗРК ПАНЦИРЬ-С2 (Взаємодія)", "30061500321111040000"),
    ("01.09.23 ЗРГК ПАНЦИР рф (Взаємодія)", "30061500321111040000"),
    ("02.09.23 ЗРГК ПАНЦИР-С2 (Взаємодія)", "30061500321111040000"),
    ("ЗРК ППО ПАНЦИР С1", "30061500321111040000"),
    ("ЗРК ППО ПАНЦИР С2", "30061500321111040000"),
    ("ЗРК ППО ОСА", "30061500321111050000"),
    ("ОСА", "30061500321111050000"),
    ("ЗРК Панцир-С2", "30061500321111040000"),
    # РЕБ
    ("04.09.23 Комплекс придушення сигналів навігаційних систем", "30061000001505040000"),
    ("04.09.23 Борисоглебськ-2", "30061000001505040000"),
    ("10.09- Пеленг P-934БМВ 50.2731 38.0172", "30061000001505040000"),
    ("04.09.23 96Л6", "30061500322203000000"),
    ("Р-934", "30061000001505040000"),
    ("Створення перешкод", "30061000001505040000"),
    ("EW", "30061000001505040000"),
    # мінування
    ("05.09.23 Район мінування", "30062500002707010000"),
    ("Міни ТМ-62", "30061500002103000000"),
    # птрк
    ("04.09.23 «Метис-М» (9К115-2)", "30061500001112030000"),
    ("17.09.23 позиція ПТРК 72 омсбр", "30061500001112000000"),
    ("Пускова установка протитанкової ракети", "30061500001117000000"),
    # паливо
    ("Топливозаправники 4 од.", "30061500321409000000"),
    ("Транспорт ПММ", "30061500321409000000"),
    ("30 ОС, 5 ВАТ, 7 бензовозів", "30061500321409000000"),
    # артилерія
    ("ствольна артилерія", "30061500351109000000"),
    ("Артилерія", "30061500351109000000"),
    ("Артилерійські установки", "30061500351109000000"),
    ("Орудие", "30061500351107000000"),
    ("ARTILLERY", "30061500351109000000"),
    # ОТРК
    ("Іскандер", "30061500321113000000"),
    # Піхота
    ("Піхота", "30061000001211000000"),
    ("INFANTRY", "30061000001211000000"),
    # міномет
    ("Міномет 120 мм (буксирований)", "30061500351114030000"),
    ("Артилерія на вогневих позиціях: ймовірно 1 міномет 2С4", "30061510331114030000"),
    ("MORTAR", "30061500001114000000"),
    # САУ
    (" Гвоздика", "30061500331109010000"),
    # Проживання
    ("Проживання ОС", "30062000001208000000"),
    # авіація
    ("Су-34 в польоті на південний захід", "30060100001101050000"),
    ("Ан-72", "30060100001101070000"),
    ("Ан-26", "30060100001101070000"),
    # Відео
    ("Відео (бойова камера)", "30061000001112000000"),
    # гранатомет
    ("Гранатомет", "30061500001103000000"),
    # ремонт і обслуговування
    ("Ремонтна база", "30062000001213060000"),
    ("База ремонту / відновлення", "30062000001213060000"),
    # медичка
    ("Стабілізаційний медичний пункт", "30062000001207020000"),
    # навчальний табір
    ("Навчальний табір", "30062000001119020000"),
    ("Навчальний полігон ров", "30062000001119020000"),
    # автомобілі / ЛАТ
    ("Автомобіль", "30061500001601000000"),
    # кулемет
    ("Кулемет", "30061500001102000000"),
    # вогневі позиції
    ("арт. позиція", "30062500002501000000"),
    ("вогневі позиції", "30062500002501000000"),
    # залізниця
    ("Залізнична станція РОДАКОВО", "30062000001213070000"),
    ("Залізничні станції Дебальцеве та Дебальцеве-Сортувальна", "30062000001213070000"),
    ("Локомотивне депо Дебальцеве", "30062000001213070000"),
    # місце перезаряджання
    ("Місце перезарядження  артилерії", "30062500003202000000"),
    # підрозділ
    ("тактичний підрозділ св зс рф", "30061000001200000000"),
    # евак
    ("Група евакуації", "30062500003211000000"),
    # КББ
    ("РЛК ЯСТРЕБ АВ", "30061500322203000000"),
    # СП
    ("Створення: 2024-01-10 13:52:40 | pep Оновлення: 2024-01-10 13:52:36 | pep Lat, Lng: 48.196246, 37.678888 DMS: N48°11'46.49', E37°40'44.00' СК-42: X: 5341194, Y: 7401900 MGRS: 37UDP0182638956 UTM: Z: 37U, E: 401826, N: 5338956 Тип: Спостережний пункт (СП) - Аванпост передового спостерігача - Точка/аванпост спостереження - Точки маневрування - Польові укріплення та умовні точки Ворожість: Ворожий Висота над рівнем моря, м: 204 UUID: 1f3d3d9e-24d8-4745-9932-694c241dc686", "30062500001601000000"),
    # точки
    ("Пункт загального постачання", "30062500003217000000"),
    ("TROOP SUSTAINMENT/MILITARY TRUCKS", "30062500003217000000"),
    ("TROOP SUSTAINMENT / CARGO", "30062500003217000000"),
    ("WEAPONS / EQUIPTMENT SHIPMENT", "30062500003217000000"),
    # склади
    ("склади боєприпасів", "30062000001103000000"),
    ("AMMUNITION CACHE", "30062000001103000000"),
    # БПЛА
    ("GCS", "30061000111219000021"),
    # інфраструктура
    ("Міст автомобільний, р. Красна, північ Сватове. з квітня 2023", "30062000001107010000"),
    ("BRIDGE CONSTRUCTION", "30062000001107010000"),
    ("FLOATING BRIDGE", "30061500001304000000"),
    ("Електропідстанція Михайлівська-400 ПС 400/330/220/110 кВ. від ЛБЗ 30 км", "30062000001205010000"),
    ("Електрична підстанція", "30062000001205010000"),
    ("WATER SUPPLY INFRASTRUCTURE", "30062000001214000000"),
    ("PETROL STATION", "30062000001205040000"),
    ("ENERGY FACILITY", "30062000001205000000"),
    # госпіталь/лікарня
    ("3RD MSD MEDICAL FACILITY", "30062000001207020000"),
    # вантажівка
    ("MILITARY CARGO VEHICLES", "30061500001408000000"),
    # антена
    ("BROADCAST ANTENNA", "30061500002001000000"),
    # міни
    ("Конец мон50 9шт, пмн4-20 шт, пмн2-70 шт", "30061500002102000000")
])

def test_unit_designator(input_text, expected_sidc):
    sidc = UnitDesignator.calculate_icon(input_text.upper())
    assert sidc == expected_sidc, f"Expected SIDC: {expected_sidc}, but got: {sidc} with input: {input_text}"
